//************************ Copyright(C) New Media Life Inc. ********************
//
// Description : EQ Preset Value for NML
// 
// $Source: /home/cvsroot/TAVI020/tavi/3Dsound/SEQ_Coeff.c,v $
// $Revision: 1.1.1.1 $
// $Date: 2006/02/22 12:33:31 $
// $Author: zstein $
//
//******************************************************************************
// $Log: SEQ_Coeff.c,v $
// Revision 1.1.1.1  2006/02/22 12:33:31  zstein
// TAVI020 REBUILD
//
// Revision 1.2  2005/12/29 08:30:02  ywkim
// Change parameter of flat to 4,2,0,1,3
//
// Revision 1.1  2005/12/28 06:08:33  ywkim
// Update library with 051228_1 for custom setting EQ preset
//
//******************************************************************************
#if 0
////////////////////////////////////////////////////////////////////////
// EQ 프리셋 값을 NML에서 직접 조정할 수 있도록 수정
// setting 값 순서는 H 파일 참고하시어 프리셋 값을 주면 됨
// 아래 항목에 프리셋 값은 이머시스에서 튜닝한 setting 값임

const int SEQ_preset_value[20][5] = {
	{ 9, 9, 9, 9, 9},    // FLAT    	// 기능성 EQ
	{ 0, 8,13,13, 7},    // VOICE
	{18,18,10, 9,11},    // POWERBASS
	{ 7, 8, 9,13,14},    // BRIGHT
	{10,10, 9, 5, 3},    // DARKWARM

	{13,12, 9, 7, 6},    // CLASSIC    // 음악장르별 EQ
	{15,16, 4,14,11},    // HARDROCK
	{11,12, 7,11,11},    // SOFTROCK
	{10,11,13,12, 9},    // JAZZ
	{17, 6,13, 9,13},    // DANCE
	{13, 9, 6, 8,12},    // SLOW
	{11, 7,11,13,15},    // POP
	{ 9,14,10,11,16},    // BLUES
	{16,11, 9,10,14},    // INSTRUMENTAL
	{14, 7, 6,13, 9},    // FUNK

	{10,15,14,11, 9},    // ACOUSTIC
	{ 8,15,13, 7,11},    // ELECTRONIC
	{13,13, 8, 9,12},    // HIPHOP
	{11,11,13, 9, 9},    // LATIN
	{ 0, 4,12,12, 4}     // LECTURE
};
#else
///////////////////////////////////////////////////////////////////////////
// defined by NML
const int SEQ_preset_value[20][5] = {
	{13,11, 9,10,12},    // FLAT    	// 기능성 EQ
	{ 4, 9,13,12, 7},    // VOICE
	{18,18,10, 9,11},    // POWERBASS
	{ 7, 8, 9,13,14},    // BRIGHT
	{11,10, 9, 7, 7},    // DARKWARM

	{15,12, 9,10,12},    // CLASSIC    // 음악장르별 EQ
	{15,16, 4,14,11},    // HARDROCK
	{11,12, 7,11,12},    // SOFTROCK
	{15,11,13,12,11},    // JAZZ
	{18, 6,13,11,14},    // DANCE
	{13, 9, 8, 8,12},    // SLOW
	{11, 7,11,13,15},    // POP
	{15,14,10,11,14},    // BLUES
	{16,11, 9,11,14},    // INSTRUMENTAL
	{14, 7, 6,13, 9},    // FUNK

	{15,15,14,11, 14},    // ACOUSTIC
	{ 8,15,13,13,11},    // ELECTRONIC
	{13,13, 8, 9,12},    // HIPHOP
	{14,11,13,11,14},    // LATIN
	{ 0, 4,12,12, 4}     // LECTURE
};

#endif
////////////////////////////////////////////////////////////////////////
